<a href="https://colab.research.google.com/github/mutemip/29ofmay/blob/main/AfterWork_Data_Science_Data_Wrangling_with_Python_Crash_Course.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="blue">To use this notebook on Colaboratory, you will need to make a copy of it. Go to File > Save a Copy in Drive. You can then use the new copy that will appear in the new tab.</font>

# Data Wrangling with Python // Crash Course

## Pre-requisites

In [1]:
# Pre-requisite 1
# ---
# The first thing that we will do in this notebook is
# to import the pandas library for data manipulation.
# ---
# OUR CODE GOES BELOW
#
import pandas as pd

In [2]:
# Pre-requisite 2
# ---
# We will also import the numpy library which
# will allow us to perform scientific computations.
# ---
# For those who are not familiar with what a library is,
# A library is a collection of related pieces of code that
# have been compiled and stored together for reuse.
# ---
# OUR CODE GOES BELOW
#
import numpy as np

## 1. Reading Data

In [3]:
# Example 1
# ---
# Loading a dataset (csv file) from a url
# ---
# Dataset url (csv file) = http://bit.ly/IrisDataset
# ---
# OUR CODE GOES BELOW
#

# Reading our csv file from the given url and storing it to a dataframe.
# A data frame is a two-dimensional data structure that is used to
# represent a table of data with rows and columns.
# ---
#
df = pd.read_csv("http://bit.ly/IrisDataset")

# Previewing the first 5 records
df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [9]:
# Example 2
# ---
# We can also load A CSV Into pandas as shown below
# ---
# Dataset url = http://bit.ly/CitiesDataset1
# ----
# Instructions:
# 1. Visit the above dataset url with a browser. Then download the file.
# 2. Within this notebook you will need to have the Table of contents left sidebar open.
#    If its not open, you can open the sidebar clicking at the top of the notebook View -> Table of Contents.
# 3. Once its open click on the Files tab within the sidebar (this is on the farmost right).
# 4. Then upload the downloaded file to this location/ Or drag the file
# 5. Once uploaded you will use the name of the file to open the file as shown below.
#    You can also store in a directory/folder then reference that directory while reading the file.
#    i.e. the file cities stored in a directory named finance, then the reference pd.read_csv("/finance/cities.csv")
# ---
#

# Let's read the cities csv file
df_cities = pd.read_csv("sampleData/cities.csv")
# df_cities = pd.read_csv("http://bit.ly/CitiesDataset1")

# Previewing the first five records
df_cities.head()

       city         country  latitude  longitude  temperature
0   Aalborg         Denmark     57.03       9.92         7.52
1  Aberdeen  United Kingdom     57.17      -2.08         8.10
2    Abisko          Sweden     63.35      18.83         0.20
3     Adana          Turkey     36.99      35.32        18.67
4  Albacete           Spain     39.00      -1.87        12.62

## 2. Data Exploration

In [4]:
# Example 2a
# ---
# Determining the no. of records in the dataset
# NB: We will use the above loaded dataset in example 1
# ---
# OUR CODE GOES BELOW
#

# Shape returns no. or records/instances (left) and columns/variables (right)
#
df.shape

(150, 5)

In [ ]:
# Example 2b
# ---
# Previewing the last few records/instances of our dataset
# ---
# OUR CODE GOES BELOW
#
df.sample()

     sepal_length  sepal_width  petal_length  petal_width          species
114           5.8          2.8           5.1          2.4   Iris-virginica
71            6.1          2.8           4.0          1.3  Iris-versicolor
126           6.2          2.8           4.8          1.8   Iris-virginica
35            5.0          3.2           1.2          0.2      Iris-setosa
33            5.5          4.2           1.4          0.2      Iris-setosa

In [ ]:
# Example 2c
# ---
# Checking the datatypes of df variables (columns)
# ---
# OUR CODE GOES BELOW
#
df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

## 3. Irrelevant Data

#### <font color="blue">Examples</font>

In [ ]:
# Example 1
# ---
# We can also deleting/dropping irrelevant columns/features.
# By irrelevant we mean dataset features that we don't need
# to answer a research question.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# Hint: Use the df dataframe you created earlier
# ---
# OUR CODE GOES BELOW
#
df_cities.head()

       city         country  latitude  longitude  temperature
0   Aalborg         Denmark     57.03       9.92         7.52
1  Aberdeen  United Kingdom     57.17      -2.08         8.10
2    Abisko          Sweden     63.35      18.83         0.20
3     Adana          Turkey     36.99      35.32        18.67
4  Albacete           Spain     39.00      -1.87        12.62

In [ ]:
# Deleting an Irrelevant Column i.e. if we didn't require the column city
# to answer our research question.
# ---
# While dropping/deleting those two columns:
# a) We set axis = 1
#    A dataframe has two axes: “axis 0” and “axis 1”.
#    “axis 0” represents rows and “axis 1” represents columns.
# b) We can also set Inplace = True.
#    This means the changes would be made to the original dataframe.
# Dropping the irrelevant columns i.e. Team and Weight
# Those values were dropped since axis was set equal to 1 and
# the changes were made in the original data frame since inplace was True.
#
df_cities.drop(["city"], axis = 1, inplace = True)

# And preview our resulting dataset
# ---
#
df_cities.head()

          country  latitude  longitude  temperature
0         Denmark     57.03       9.92         7.52
1  United Kingdom     57.17      -2.08         8.10
2          Sweden     63.35      18.83         0.20
3          Turkey     36.99      35.32        18.67
4           Spain     39.00      -1.87        12.62

In [ ]:
# We can drop multiple columns as shown
# ---
#
df_cities.drop(["latitude", "longitude"], axis = 1, inplace = True)

# And preview our resulting dataset
# ---
#
df_cities.head()

          country  temperature
0         Denmark         7.52
1  United Kingdom         8.10
2          Sweden         0.20
3          Turkey        18.67
4           Spain        12.62

## 4. Duplicates

#### <font color="blue">Examples</font>

In [ ]:
# Example 1
# ---
# Finding duplicate records
# -> Duplicate records are repeated records in a dataset.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
#

nba_df = pd.read_csv('http://bit.ly/NBABasketballDataset')

# Again, we first explore our dataset by determining the shape of
# our dataset (records/instances, columns/variables)
# ---
#
nba_df.shape

(458, 9)

In [ ]:
nba_df.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter   oston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [ ]:
# We can then identify which observations are duplicates
# through the duplicated() function and sum() to know how many
# duplicate records there are.
# Normally, duplicate records are dropped from the dataset.
# But in our case we don't have any duplicate records.
# ---
#
nba_df = nba_df[nba_df.duplicated()]

In [ ]:
# Finding the no. of duplicates
# ---
#
sum(nba_df.duplicated())

0

In [ ]:
# Example 2
# ---
# Dropping duplicate columns
# ---
# Dataset = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
#

# In our previous dataset, if there were duplicates we
# could have dropped the through the use of the drop_duplicates() function
# as shown in this example
# ---
#
nba_df_duplicates = nba_df.drop_duplicates()

In [ ]:
nba_df_duplicates.shape

(0, 9)

In [ ]:
# Example 3
# ---
# Dropping duplicates in a specific column in the df dataframe
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
#

# We can also consider records with repeated variables/columns
# as duplicates and deal with them. For example, we can
# identify duplicates in our dataset based on country.
# ---
#
duplicates_df = nba_df[nba_df.duplicated(['College'])]
duplicates_df

                 Name            Team  ...         College      Salary
5        Amir Johnson  Boston Celtics  ...             NaN  12000000.0
12        Evan Turner  Boston Celtics  ...      Ohio State   3425510.0
15   Bojan Bogdanovic   Brooklyn Nets  ...             NaN   3425510.0
16       Markel Brown   Brooklyn Nets  ...  Oklahoma State    845059.0
17    Wayne Ellington    rooklyn Nets  ...  North Carolina   1500000.0
..                ...             ...  ...             ...         ...
453      Shelvin Mack       Utah Jazz  ...          Butler   2433333.0
454         Raul Neto       Utah Jazz  ...             NaN    900000.0
455      Tibor Pleiss       Utah Jazz  ...             NaN   2900000.0
456       Jeff Withey       Utah Jazz  ...          Kansas    947276.0
457               NaN             NaN  ...             NaN         NaN

[339 rows x 9 columns]

In [ ]:
# Then dropping the duplicates as shown below.
# NB: We will create in a new dataframe object which will contain our unique dataframe
# which won't have any duplicates.
# ---
#
unique_df = nba_df.drop_duplicates(['College'])

# Determining the size of our new dataset
# We note that the two records were dropped from our original dataset
# ---
#
unique_df.shape

(119, 9)

## 5. Filtering

#### <font color="blue">Examples & Challenges</font>

In [ ]:
# Example 4a
# ---
# Selecting rows when columns contain certain values
# ---
# NB: Selecting records where petal_length is 5.0
# ---
# OUR CODE GOES BELOW
#

# Reading our csv file from the given url and storing it to a dataframe.
iris_df = pd.read_csv("http://bit.ly/IrisDataset")

# Previewing the first 5 records
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [ ]:
# Selecting the records where column has certain values
# ---
#
iris_df[iris_df.petal_length.isin(['5.0'])]

     sepal_length  sepal_width  petal_length  petal_width          species
77            6.7          3.0           5.0          1.7  Iris-versicolor
113           5.7          2.5           5.0          2.0   Iris-virginica
119           6.0          2.2           5.0          1.5   Iris-virginica
146           6.3          2.5           5.0          1.9   Iris-virginica

In [ ]:
# Example 4b
# ---
# Selecting the records where column doesn't have certain values
# in our case, where petal_leghth is not 5.0
# ---
# OUR CODE GOES BELOW
#

iris_df[~iris_df.petal_length.isin(['5.0'])]

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
144           6.7          3.3           5.7          2.5  Iris-virginica
145           6.7          3.0           5.2          2.3  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[146 rows x 5 columns]

In [ ]:
# Example 4c
# ---
# Selecting records using filters where petal_width greater than 1.9
# ---
# OUR CODE GOES BELOW
#

iris_df[(iris_df.petal_width > 1.9)]

     sepal_length  sepal_width  petal_length  petal_width         species
100           6.3          3.3           6.0          2.5  Iris-virginica
102           7.1          3.0           5.9          2.1  Iris-virginica
104           6.5          3.0           5.8          2.2  Iris-virginica
105           7.6          3.0           6.6          2.1  Iris-virginica
109           7.2          3.6           6.1          2.5  Iris-virginica
110           6.5          3.2           5.1          2.0  Iris-virginica
112           6.8          3.0           5.5          2.1  Iris-virginica
113           5.7          2.5           5.0          2.0  Iris-virginica
114           5.8          2.8           5.1          2.4  Iris-virginica
115           6.4          3.2           5.3          2.3  Iris-virginica
117           7.7          3.8           6.7          2.2  Iris-virginica
118           7.7          2.6           6.9          2.3  Iris-virginica
120           6.9          3.2           5.7          2.3  Iris-virginica
121           5.6          2.8           4.9          2.0  Iris-virginica
122           7.7          2.8           6.7          2.0  Iris-virginica
124           6.7          3.3           5.7          2.1  Iris-virginica
128           6.4          2.8           5.6          2.1  Iris-virginica
131           7.9          3.8           6.4          2.0  Iris-virginica
132           6.4          2.8           5.6          2.2  Iris-virginica
135           7.7          3.0           6.1          2.3  Iris-virginica
136           6.3          3.4           5.6          2.4  Iris-virginica
139           6.9          3.1           5.4          2.1  Iris-virginica
140           6.7          3.1           5.6          2.4  Iris-virginica
141           6.9          3.1           5.1          2.3  Iris-virginica
143           6.8          3.2           5.9          2.3  Iris-virginica
144           6.7          3.3           5.7          2.5  Iris-virginica
145           6.7          3.0           5.2          2.3  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica

In [ ]:
# Example 5d
# ---
# We can also use the query method to get for data where petal_width is equal to 1.0
# Once you run this cell, replace the equals operator == to with less than <
# or greater than > operators to see their applications as well.
# ---
# The parameter inplace makes changes in the original dataframe if True.
# We should also note the query method works if the column name doesn’t have any empty spaces.
# Hence the need replace blank spaces in our column names with '_'
# ---
#

# Let's filter our data
#
iris_df.query('petal_width == 1.9', inplace = True)

# Previewing our dataset
iris_df.head()

     sepal_length  sepal_width  petal_length  petal_width         species
101           5.8          2.7           5.1          1.9  Iris-virginica
111           6.4          2.7           5.3          1.9  Iris-virginica
130           7.4          2.8           6.1          1.9  Iris-virginica
142           5.8          2.7           5.1          1.9  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica

In [ ]:
# We can also perform multiple condition filtering as shown below
# ---
#

iris_df.query('sepal_width == 2.7 and petal_length == 5.1', inplace = True)

# Previewing our dataset
iris_df.head()

     sepal_length  sepal_width  petal_length  petal_width         species
101           5.8          2.7           5.1          1.9  Iris-virginica
142           5.8          2.7           5.1          1.9  Iris-virginica

## 6. Sorting

#### <font color="blue">Examples</font>

In [ ]:
# Example 5a
# ---
# Load the given dataframe in ascending order by reports
# ---
# OUR CODE GOES BELOW
#

# Sorting our dataset in ascending order by sepal_length
# ---
#
iris_df.sort_values(by='sepal_length', ascending=1)

     sepal_length  sepal_width  petal_length  petal_width         species
101           5.8          2.7           5.1          1.9  Iris-virginica
142           5.8          2.7           5.1          1.9  Iris-virginica

## 7. Exporting Data

#### <font color="blue">Examples</font>

In [ ]:
# Pre-requisite 7
# ---
# Importing files module
# ---
# OUR CODE GOES BELOW
#

# Files module will allow us to download our file from colaboratory
from google.colab import files

In [ ]:
# Example 7a
# ---
# Load the given dataframe in ascending order by reports
# ---
# OUR CODE GOES BELOW
#

# Create our sample dataframe
data = {'name': ['Daniel', 'Joyce', 'Elizabeth', 'Sanni', 'Sefu'],
        'year': [2012, 2012, 2013, 2014, 2014],
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Nairobi', 'Cairo', 'Cape Town', 'Adis Ababa', 'Mombasa'])
df.head()

                 name  year  reports
Nairobi        Daniel  2012        4
Cairo           Joyce  2012       24
Cape Town   Elizabeth  2013       31
Adis Ababa      Sanni  2014        2
Mombasa          Sefu  2014        3

In [ ]:
# Exporting our sample dataframe as a csv
# ---
#

df.to_csv('example.csv')

# NB: In order to download our files from colaboratory we need to run the following
#
files.download('example.csv')

In [ ]:
# Example 7b
# ---
# Exporting our sample dataframe as a excel file (xlsx)
# ---
# ---
# OUR CODE GOES BELOW
#

df.to_excel('example.xlsx')

# NB: In order to download our files from colab we need to run the following
#
files.download('example.xlsx')